{"class_name": "Functional", "config": {"name": "xlnet_model_MultiLabel_MultiClass", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "int32", "sparse": false, "ragged": false, "name": "input_ids"}, "name": "input_ids", "inbound_nodes": []}, {"class_name": "Custom>TFXLNetMainLayer", "config": {"name": "transformer", "trainable": true, "dtype": "float32", "config": {"vocab_size": 32000, "d_model": 1024, "n_layer": 24, "n_head": 16, "d_head": 64, "ff_activation": "gelu", "d_inner": 4096, "untie_r": true, "attn_type": "bi", "initializer_range": 0.02, "layer_norm_eps": 1e-12, "dropout": 0.1, "mem_len": null, "reuse_len": null, "bi_data": false, "clamp_len": -1, "same_length": false, "summary_type": "last", "summary_use_proj": true, "summary_activation": "tanh", "summary_last_dropout": 0.1, "start_n_top": 5, "end_n_top": 5, "bos_token_id": 1, "pad_token_id": 5, "eos_token_id": 2, "use_mems_eval": true, "use_mems_train": false, "return_dict": true, "output_hidden_states": false, "output_attentions": false, "torchscript": false, "torch_dtype": null, "use_bfloat16": false, "pruned_heads": {}, "tie_word_embeddings": true, "is_encoder_decoder": false, "is_decoder": false, "cross_attention_hidden_size": null, "add_cross_attention": false, "tie_encoder_decoder": false, "max_length": 20, "min_length": 0, "do_sample": false, "early_stopping": false, "num_beams": 1, "num_beam_groups": 1, "diversity_penalty": 0.0, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "typical_p": 1.0, "repetition_penalty": 1.0, "length_penalty": 1.0, "no_repeat_ngram_size": 0, "encoder_no_repeat_ngram_size": 0, "bad_words_ids": null, "num_return_sequences": 1, "chunk_size_feed_forward": 0, "output_scores": false, "return_dict_in_generate": false, "forced_bos_token_id": null, "forced_eos_token_id": null, "remove_invalid_values": false, "exponential_decay_length_penalty": null, "architectures": ["XLNetLMHeadModel"], "finetuning_task": null, "id2label": {"0": "LABEL_0", "1": "LABEL_1"}, "label2id": {"LABEL_0": 0, "LABEL_1": 1}, "tokenizer_class": null, "prefix": null, "sep_token_id": null, "decoder_start_token_id": null, "task_specific_params": {"text-generation": {"do_sample": true, "max_length": 250}}, "problem_type": null, "_name_or_path": "xlnet-large-cased", "transformers_version": "4.19.0", "model_type": "xlnet"}}, "name": "transformer", "inbound_nodes": [{"input_ids": ["input_ids", 0, 0, {}]}]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean", "trainable": true, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean", "inbound_nodes": [["transformer", 0, 0, {"axis": 1}]]}, {"class_name": "Dropout", "config": {"name": "pooled_output", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "pooled_output", "inbound_nodes": [[["tf.math.reduce_mean", 0, 0, {"training": false}]]]}, {"class_name": "Dense", "config": {"name": "issue", "trainable": true, "dtype": "float32", "units": 39, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "issue", "inbound_nodes": [[["pooled_output", 0, 0, {}]]]}], "input_layers": {"input_ids": ["input_ids", 0, 0]}, "output_layers": {"gtts_language": ["issue", 0, 0]}}, "keras_version": "2.8.0", "backend": "tensorflow"}